["Did you know Aiden has a breeding guide? http://bit.ly/AidensBreedingGuide ","Master ball and Cherish ball are the only two balls that cannot be passed down. ","HA male has 20% chance of passing down HA when breeding with non-HA female ","Tonemy is the only pokemon without HA that has an evolution with HA. ","Every pokemon in Grass egg group is also in another egg group. ","TM moves can only be passed down if the father knows it. ","It is possible to pass down pokeball when breeding with Duplicat. It will only happen when breeding with a female and the female is deposited in the daycare first. The offspring will inherit the ball from the mother. ","HAs are not necessarily better than Regular Abilities. For instance, breeding Jerbolta for its HA has no competitive benefits. ","Males do not effect the ball that the offspring is born in. ","The Breeders Guild PU Discord Server was created on September 2nd, 2016. ","If you want to pass down multiple egg moves to a species within the Field egg group, you do not need a high IV parent for each move. Using a high IV male Ratsy to sketch and pass down all moves will save a lot of time. ","Breeding a HA female with a HA male will **not** result in their individual chances of passing down that Ability stacking. ","The first HA Chimical ever was distributed as a Mystery Gift during the Beta stage of the game. ","If both parents are holding an Everstone, the offspring will randomly inherit the nature from either of them. ","There are only 9 breedable genderless evolutionary lines in Uranium. ","The first 6 IV Praseopunk and Neopunk were hatched the same day they were released. ","Stable Nuclear species were not breedable when the game was released. ","The effect of Magma Armor and Flame Body will not stack if you have multiple pokemon with either ability in your party. ","Some evolutionary lines cannot learn any Egg Moves. ","Genderless species cannot be ball bred. ","Some Mystery Gift pokemon are infected with a stronger strain from pokerus, which lasts longer than the one available in-game. "]